{
  "pt": {
    "meta.title": "Wallet360 – Como Funciona",
    "meta.desc": "Descobre como a Wallet360 te ajuda a digitalizar faturas, acompanhar despesas e visualizar os teus ganhos.",
    "og.title": "Wallet360 - Como Funciona",
    "og.desc": "Explora o funcionamento da Wallet360 e começa a gerir melhor o teu dinheiro hoje mesmo!",
    "how.title": "Como Funciona",
    "how.intro": "Wallet360 permite-te digitalizar faturas, analisar despesas e acompanhar os teus rendimentos com facilidade.",
    "how.step1.title": "1. Digitaliza Faturas com QR Code",
    "how.step1.desc": "Usa a câmara do telemóvel ou carrega uma imagem para ler faturas com QR Code automaticamente.",
    "how.step2.title": "2. Adiciona Manualmente",
    "how.step2.desc": "Se não tiveres QR Code, podes inserir os dados manualmente com poucos cliques.",
    "how.step3.title": "3. Vê Estatísticas e Gráficos",
    "how.step3.desc": "Consulta gráficos de IVA, despesas por categoria, meses e muito mais.",
    "how.step4.title": "4. Exporta os Teus Dados",
    "how.step4.desc": "Exporta tudo em CSV para partilhar ou guardar em segurança."
  },
  "en": {
    "meta.title": "Wallet360 – How It Works",
    "meta.desc": "Learn how Wallet360 helps you scan receipts, track spending, and visualize your financial progress.",
    "og.title": "Wallet360 - How It Works",
    "og.desc": "Discover how Wallet360 works and start managing your money today!",
    "how.title": "How It Works",
    "how.intro": "Wallet360 lets you scan receipts, analyze spending, and track your income easily.",
    "how.step1.title": "1. Scan Receipts with QR Code",
    "how.step1.desc": "Use your phone camera or upload an image to read QR code receipts automatically.",
    "how.step2.title": "2. Add Manually",
    "how.step2.desc": "If no QR is available, manually enter your expenses in just a few clicks.",
    "how.step3.title": "3. View Stats & Charts",
    "how.step3.desc": "See VAT breakdowns, categories, monthly trends, and more.",
    "how.step4.title": "4. Export Your Data",
    "how.step4.desc": "Download all your data as CSV to save or share securely."
  },
  "es": {
    "meta.title": "Wallet360 – Cómo Funciona",
    "meta.desc": "Descubre cómo Wallet360 te ayuda a escanear facturas, seguir tus gastos y visualizar tus ganancias.",
    "og.title": "Wallet360 - Cómo Funciona",
    "og.desc": "Explora el funcionamiento de Wallet360 y empieza a controlar tu dinero hoy mismo.",
    "how.title": "Cómo Funciona",
    "how.intro": "Wallet360 te permite escanear facturas, analizar gastos y controlar ingresos fácilmente.",
    "how.step1.title": "1. Escanea Facturas con Código QR",
    "how.step1.desc": "Usa la cámara del móvil o sube una imagen para leer automáticamente las facturas.",
    "how.step2.title": "2. Añade Manualmente",
    "how.step2.desc": "Si no hay código QR, introduce los datos manualmente en pocos clics.",
    "how.step3.title": "3. Ver Estadísticas y Gráficas",
    "how.step3.desc": "Consulta gráficos de IVA, gastos por categoría y por mes.",
    "how.step4.title": "4. Exporta tus Datos",
    "how.step4.desc": "Descarga todo en CSV para compartir o guardar con seguridad."
  },
  "fr": {
    "meta.title": "Wallet360 – Comment ça Marche",
    "meta.desc": "Découvrez comment Wallet360 vous aide à scanner les reçus, suivre vos dépenses et visualiser vos gains.",
    "og.title": "Wallet360 - Comment ça Marche",
    "og.desc": "Apprenez à utiliser Wallet360 et commencez à gérer votre argent dès aujourd’hui.",
    "how.title": "Comment ça Marche",
    "how.intro": "Wallet360 vous permet de scanner vos reçus, analyser vos dépenses et suivre vos revenus facilement.",
    "how.step1.title": "1. Scanner des Reçus avec Code QR",
    "how.step1.desc": "Utilisez votre caméra ou téléchargez une image pour lire automatiquement les reçus.",
    "how.step2.title": "2. Ajouter Manuellement",
    "how.step2.desc": "Si aucun code QR n’est disponible, ajoutez les données à la main en quelques clics.",
    "how.step3.title": "3. Visualisez les Statistiques",
    "how.step3.desc": "Consultez les graphiques de TVA, dépenses par catégorie, et par mois.",
    "how.step4.title": "4. Exportez Vos Données",
    "how.step4.desc": "Téléchargez vos données au format CSV pour les sauvegarder ou les partager."
  }
}
